Repository: nightmere33/Data-Generator-JSON-WebSite-
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fr

source: French
ar: الفرنسية
fr: Français

source: English
ar: الإنجليزية
fr: Anglais

source: Arabic
ar: العربية
fr: Arabe

source: Tourisme Simple
ar: سياحة مفردة

source: Tourisme Multiple
ar: سياحة متعددة

source: Affaires Simple
ar: أعمال مفردة

source: Affaires Multiple
ar: أعمال متعددة

source: Traitement Simple
ar: علاج مفرد

source: Traitement Multiple
ar: علاج متعدد

source: Étudiant Simple
ar: طالب مفرد

source: Accompagnement Simple
ar: مرافق مفرد

source: Accompagnement Multiple
ar: مرافق متعدد

source: Permis de Travail Simple
ar: تصريح عمل مفرد

source: Permis de Travail Multiple
ar: تصريح عمل متعدد

source: Transit Double
ar: عبور مزدوج

source: Transit Simple
ar: عبور مفرد

source: Visa Type
ar: نوع التأشيرة
fr: Type de visa

source: Algérie
ar: الجزائر

source: États-Unis d'Amérique
ar: الولايات المتحدة الأمريكية

source: Royaume-Uni
ar: المملكة المتحدة

source: Chine
ar: الصين

source: Inde
ar: الهند

source: Italie
ar: إيطاليا

source: Canada
ar: كندا

source: Australie
ar: أستراليا

source: Allemagne
ar: ألمانيا

source: France
ar: فرنسا

source: Espagne
ar: إسبانيا

source: Turquie
ar: تركيا

source: Nationality
ar: الجنسية
fr: Nationalité

source: Contact Address
ar: عنوان الاتصال
fr: Adresse de contact

source: 123 Main Street, City, Country
ar: 123 الشارع الرئيسي، المدينة، البلد
fr: 123 Rue Principale, Ville, Pays

source: City
ar: المدينة
fr: Ville

source: Postal Code
ar: الرمز البريدي
fr: Code postal

source: Departure Date
ar: تاريخ المغادرة
fr: Date de départ

source: Return Date
ar: تاريخ العودة
fr: Date de retour

source: Minimum desired date
ar: أقل تاريخ مرغوب
fr: Date minimale souhaitée

source: Maximum allowed date
ar: أقصى تاريخ مسموح به
fr: Date maximale autorisée

source: Email
ar: البريد الإلكتروني

source: Phone
ar: الهاتف
fr: Téléphone

source: Passport numbers (one per line)
ar: أرقام جوازات السفر (رقم واحد في كل سطر)
fr: Numéros de passeport (un par ligne)

source: Enter each passport number on a new line
ar: أدخل كل رقم جواز في سطر جديد
fr: Saisissez chaque numéro de passeport sur une nouvelle ligne

source: Relations (comma separated)
ar: العلاقات (مفصولة بفواصل)
fr: Liens de parenté (séparés par des virgules)

source: Wife, Father, Mother, Child
ar: زوجة، أب، أم، طفل
fr: Épouse, Père, Mère, Enfant

source: e.g., Wife, Father, Mother, Child
ar: مثال: زوجة، أب، أم، طفل
fr: ex. : Épouse, Père, Mère, Enfant

source: First Name
ar: الاسم الأول
fr: Prénom

source: Last Name
ar: اسم العائلة
fr: Nom de famille

source: Gender
ar: الجنس
fr: Sexe

source: Male
ar: ذكر
fr: Masculin

source: Female
ar: أنثى
fr: Féminin

source: Date of Birth
ar: تاريخ الميلاد
fr: Date de naissance

source: Place of Birth
ar: مكان الميلاد
fr: Lieu de naissance

source: Marital Status
ar: الحالة الاجتماعية
fr: Situation familiale

source: Single
ar: أعزب
fr: Célibataire

source: Married
ar: متزوج
fr: Marié(e)

source: Father's Full Name
ar: الاسم الكامل للأب
fr: Nom complet du père

source: Mother's Full Name
ar: الاسم الكامل للأم
fr: Nom complet de la mère

source: Occupation
ar: المهنة
fr: Profession

source: Agriculture
ar: الزراعة

source: Armed/Security Force
ar: القوات المسلحة / الأمن
fr: Forces armées / sécurité

source: Artist/Performer
ar: فنان / مؤدٍ
fr: Artiste / interprète

source: Business
ar: أعمال
fr: Affaires

source: Caregiver/Babysitter
ar: مقدم رعاية / جليسة أطفال
fr: Aide-soignant / garde d'enfants

source: Construction
ar: البناء
fr: Bâtiment

source: Culinary/Cookery
ar: الطهي / فنون الطهي
fr: Cuisine / arts culinaires

source: Driver/Lorry
ar: سائق / شاحنة
fr: Chauffeur / poids lourd

source: Education/Training
ar: التعليم / التدريب
fr: Éducation / formation

source: Engineer
ar: مهندس
fr: Ingénieur

source: Finance/Banking
ar: المالية / البنوك
fr: Finance / banque

source: Government
ar: حكومي
fr: Fonction publique

source: Health/Medical
ar: الصحة / الطب
fr: Santé / médical

source: Information Technologies
ar: تكنولوجيا المعلومات
fr: Technologies de l'information

source: Legal Professional
ar: مهني قانوني
fr: Professionnel du droit

source: Other
ar: أخرى
fr: Autre

source: Press/Media
ar: الصحافة / الإعلام
fr: Presse / médias

source: Professional Sportsperson
ar: رياضي محترف
fr: Sportif professionnel

source: Religious Functionary
ar: موظف ديني
fr: Responsable religieux

source: Researcher/Scientist
ar: باحث / عالم
fr: Chercheur / scientifique

source: Retired
ar: متقاعد
fr: Retraité

source: Seafarer
ar: بحار
fr: Marin

source: Self-Employed
ar: عمل حر
fr: Travailleur indépendant

source: Service Sector
ar: قطاع الخدمات
fr: Secteur des services

source: Student/Trainee
ar: طالب / متدرب
fr: Étudiant / stagiaire

source: Tourism
ar: السياحة
fr: Tourisme

source: Unemployed
ar: عاطل عن العمل
fr: Sans emploi

source: Passport Issued By
ar: جهة إصدار جواز السفر
fr: Délivré par

source: Passport Authority
ar: سلطة جوازات السفر
fr: Autorité de délivrance

source: Issue Date
ar: تاريخ الإصدار
fr: Date de délivrance

source: Expiry Date
ar: تاريخ الانتهاء
fr: Date d'expiration

source: Travel Document Type
ar: نوع وثيقة السفر
fr: Type de document de voyage

source: Passeport Ordinaire
ar: جواز سفر عادي

source: Passeport Diplomatique
ar: جواز سفر دبلوماسي

source: Carte d'Identité
ar: بطاقة هوية

source: Autres
ar: أخرى

source: Document de Voyage pour Réfugiés
ar: وثيقة سفر للاجئين

source: Password
ar: كلمة المرور
fr: Mot de passe

source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

source: Agency Name
ar: اسم الوكالة
fr: Nom de l'agence

source: Passwords do not match
ar: كلمات المرور غير متطابقة
fr: Les mots de passe ne correspondent pas

source: Email already registered
ar: البريد الإلكتروني مسجل بالفعل
fr: E-mail déjà enregistré

source: Mosaic Visa Generator - Create JSON Data
ar: مولد فيزا موزايك - إنشاء بيانات JSON
fr: Générateur Mosaic Visa - Créer des données JSON

source: Mosaic Visa
ar: فيزا موزايك

source: JSON Generator
ar: مولد JSON
fr: Générateur JSON

source: Welcome, %(name)s
ar: مرحباً، %(name)s
fr: Bienvenue, %(name)s

source: Create Data
ar: إنشاء بيانات
fr: Créer des données

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

source: Login
ar: تسجيل الدخول
fr: Connexion

source: Home
ar: الرئيسية
fr: Accueil

source: Create New Data
ar: إنشاء بيانات جديدة
fr: Créer de nouvelles données

source: Create JSON data for Mosaic Visa appointments. Simple, fast, and mobile-friendly.
ar: أنشئ بيانات JSON لمواعيد فيزا موزايك. بسيطة وسريعة ومتوافقة مع الجوال.
fr: Créez des données JSON pour les rendez‑vous Mosaic Visa. Simple, rapide et adapté aux mobiles.

source: Quick Links
ar: روابط سريعة
fr: Liens rapides

source: Features
ar: الميزات
fr: Fonctionnalités

source: Mobile-Friendly
ar: متوافق مع الجوال
fr: Adapté aux mobiles

source: Secure Processing
ar: معالجة آمنة
fr: Traitement sécurisé

source: Instant JSON
ar: JSON فوري
fr: JSON instantané

source: Mosaic Visa JSON Generator
ar: مولد JSON لفيزا موزايك
fr: Générateur JSON Mosaic Visa

source: Generate JSON data for visa appointment automation
ar: أنشئ بيانات JSON لأتمتة مواعيد التأشيرة
fr: Générez des données JSON pour l'automatisation des rendez‑vous de visa

source: Please fill in all required fields.
ar: يرجى ملء جميع الحقول المطلوبة.
fr: Veuillez remplir tous les champs obligatoires.

source: Fill Form
ar: املأ النموذج
fr: Remplir le formulaire

source: Preview
ar: معاينة
fr: Aperçu

source: Download
ar: تنزيل
fr: Télécharger

source: Common Application Information
ar: معلومات الطلب المشتركة
fr: Informations communes

source: Shared details for all applicants
ar: تفاصيل مشتركة لجميع المتقدمين
fr: Détails partagés pour tous les demandeurs

source: Minimum Desired Date
ar: أقل تاريخ مرغوب
fr: Date minimale souhaitée

source: Earliest acceptable appointment date
ar: أقدم تاريخ موعد مقبول
fr: Date de rendez‑vous la plus proche acceptable

source: Maximum Allowed Date
ar: أقصى تاريخ مسموح به
fr: Date maximale autorisée

source: Latest acceptable appointment date
ar: أحدث تاريخ موعد مقبول
fr: Date de rendez‑vous la plus éloignée acceptable

source: Passport numbers
ar: أرقام جوازات السفر
fr: Numéros de passeport

source: One per line
ar: واحد في كل سطر
fr: Un par ligne

source: Relations
ar: العلاقات
fr: Liens de parenté

source: Comma separated, e.g., Wife, Father, Mother
ar: مفصولة بفواصل، مثال: زوجة، أب، أم
fr: Séparés par des virgules, ex. : Épouse, Père, Mère

source: Applicants Information
ar: معلومات المتقدمين
fr: Informations des demandeurs

source: Add details for each applicant (maximum 5)
ar: أضف تفاصيل لكل متقدم (الحد الأقصى 5)
fr: Ajoutez les détails pour chaque demandeur (maximum 5)

source: Add Applicant
ar: أضف متقدمًا
fr: Ajouter un demandeur

source: Applicant
ar: متقدم
fr: Demandeur

source: Personal and passport details
ar: التفاصيل الشخصية وجواز السفر
fr: Coordonnées personnelles et passeport

source: Ready to Generate JSON?
ar: هل أنت مستعد لإنشاء JSON؟
fr: Prêt à générer le JSON ?

source: Your data is processed locally and not stored on our servers
ar: تتم معالجة بياناتك محليًا ولا تُخزن على خوادمنا
fr: Vos données sont traitées localement et ne sont pas stockées sur nos serveurs

source: Clear Form
ar: مسح النموذج
fr: Effacer le formulaire

source: Preview & Generate JSON
ar: معاينة وإنشاء JSON
fr: Aperçu et génération JSON

source: All fields are required unless marked optional
ar: جميع الحقول مطلوبة ما لم يُذكر خلاف ذلك
fr: Tous les champs sont obligatoires sauf mention contraire

source: Dates should be in YYYY-MM-DD format
ar: يجب أن تكون التواريخ بصيغة YYYY-MM-DD
fr: Les dates doivent être au format AAAA-MM-JJ

source: Start Creating Your Data
ar: ابدأ في إنشاء بياناتك
fr: Commencez à créer vos données

source: 1. Fill Form
ar: ١. املأ النموذج
fr: 1. Remplir le formulaire

source: Enter your visa application details
ar: أدخل تفاصيل طلب التأشيرة الخاص بك
fr: Saisissez les détails de votre demande de visa

source: 2. Download
ar: ٢. تنزيل
fr: 2. Télécharger

source: Get your JSON data file
ar: احصل على ملف بيانات JSON الخاص بك
fr: Obtenez votre fichier de données JSON

source: 3. Share
ar: ٣. مشاركة
fr: 3. Partager

source: Send to administrator for auto-filling
ar: أرسل إلى المسؤول للتعبئة التلقائية
fr: Envoyez à l'administrateur pour le remplissage automatique

source: Works perfectly on all devices
ar: يعمل بشكل مثالي على جميع الأجهزة
fr: Fonctionne parfaitement sur tous les appareils

source: Secure & Private
ar: آمن وخاص
fr: Sécurisé et privé

source: No data stored on our servers
ar: لا تُخزن البيانات على خوادمنا
fr: Aucune donnée stockée sur nos serveurs

source: Fast & Easy
ar: سريع وسهل
fr: Rapide et facile

source: Generate data in seconds
ar: أنشئ البيانات في ثوانٍ
fr: Générez des données en quelques secondes

source: Tampermonkey Ready
ar: جاهز لـ Tampermonkey
fr: Prêt pour Tampermonkey

source: Perfect JSON format for automation
ar: تنسيق JSON مثالي للأتمتة
fr: Format JSON parfait pour l'automatisation

source: Simple Process
ar: عملية بسيطة
fr: Processus simple

source: Fill the Form
ar: املأ النموذج
fr: Remplir le formulaire

source: Enter your visa application details for you and your family members.
ar: أدخل تفاصيل طلب التأشيرة لك ولأفراد أسرتك.
fr: Saisissez les détails de votre demande de visa pour vous et les membres de votre famille.

source: Download Your Data
ar: نزِّل بياناتك
fr: Téléchargez vos données

source: Get a JSON file with Tampermonkey integration code and your data.
ar: احصل على ملف JSON يحتوي على كود تكامل Tampermonkey وبياناتك.
fr: Obtenez un fichier JSON avec le code d'intégration Tampermonkey et vos données.

source: Send to Administrator
ar: أرسل إلى المسؤول
fr: Envoyer à l'administrateur

source: Share the file with your administrator via WhatsApp or email.
ar: شارك الملف مع مسؤولك عبر واتساب أو البريد الإلكتروني.
fr: Partagez le fichier avec votre administrateur par WhatsApp ou e-mail.

source: Ready to Get Started?
ar: هل أنت مستعد للبدء؟
fr: Prêt à commencer ?

source: Create your Mosaic Visa JSON data now. It's free and takes just a few minutes.
ar: أنشئ بيانات JSON لفيزا موزايك الآن. إنها مجانية وتستغرق بضع دقائق فقط.
fr: Créez vos données JSON Mosaic Visa maintenant. C'est gratuit et ne prend que quelques minutes.

source: Create Your Visa Data Now
ar: أنشئ بيانات تأشيرتك الآن
fr: Créez vos données de visa maintenant

source: Your data is processed locally and never stored
ar: تتم معالجة بياناتك محليًا ولا تُخزن أبدًا
fr: Vos données sont traitées localement et ne sont jamais stockées

source: Login - Mosaic Visa Generator
ar: تسجيل الدخول - مولد فيزا موزايك
fr: Connexion - Générateur Mosaic Visa

source: Agency Login
ar: دخول الوكالة
fr: Connexion agence

source: Log In
ar: تسجيل الدخول
fr: Se connecter

source: Data Ready for Download
ar: البيانات جاهزة للتنزيل
fr: Données prêtes à être téléchargées

source: Your data has been generated successfully
ar: تم إنشاء بياناتك بنجاح
fr: Vos données ont été générées avec succès

source: Applicants
ar: المتقدمون
fr: Demandeurs

source: Random
ar: عشوائي
fr: Aléatoire

source: Time Slot
ar: الفترة الزمنية
fr: Créneau horaire

source: Copy
ar: نسخ
fr: Copier

source: Highlight
ar: تمييز
fr: Surligner

source: Click below to download your data file
ar: انقر أدناه لتنزيل ملف البيانات الخاص بك
fr: Cliquez ci-dessous pour télécharger votre fichier de données

source: Edit Data
ar: تعديل البيانات
fr: Modifier les données

source: Download File
ar: تنزيل الملف
fr: Télécharger le fichier

source: The file includes Tampermonkey integration code and JSON data
ar: يتضمن الملف كود تكامل Tampermonkey وبيانات JSON
fr: Le fichier contient le code d'intégration Tampermonkey et les données JSON

source: File Includes:
ar: الملف يتضمن:
fr: Le fichier contient :

source: Tampermonkey integration code (ready to paste)
ar: كود تكامل Tampermonkey (جاهز للصق)
fr: Code d'intégration Tampermonkey (prêt à coller)

source: Raw JSON data for reference
ar: بيانات JSON الخام للرجوع إليها
fr: Données JSON brutes pour référence

source: All applicant and common information
ar: جميع معلومات المتقدمين والمعلومات المشتركة
fr: Toutes les informations des demandeurs et les informations communes

source: Register - Mosaic Visa Generator
ar: تسجيل - مولد فيزا موزايك
fr: Inscription - Générateur Mosaic Visa

source: Create Agency Account
ar: إنشاء حساب وكالة
fr: Créer un compte agence

source: Phone (optional)
ar: الهاتف (اختياري)
fr: Téléphone (facultatif)

source: Register
ar: تسجيل
fr: S'inscrire

source: Download Complete - Mosaic Visa Generator
ar: اكتمل التنزيل - مولد فيزا موزايك
fr: Téléchargement terminé - Générateur Mosaic Visa

source: Download Complete!
ar: اكتمل التنزيل!
fr: Téléchargement terminé !

source: Your data file has been downloaded.
ar: تم تنزيل ملف البيانات الخاص بك.
fr: Votre fichier de données a été téléchargé.

source: Send it to your administrator for auto-filling the Mosaic Visa form.
ar: أرسله إلى مسؤولك للتعبئة التلقائية لنموذج فيزا موزايك.
fr: Envoyez-le à votre administrateur pour remplir automatiquement le formulaire Mosaic Visa.

source: Return to Home
ar: العودة إلى الرئيسية
fr: Retour à l'accueil

source: Invalid credentials
ar: بيانات الدخول غير صحيحة
fr: Identifiants invalides
